import React from 'react';
import { Sticky, Button } from '../../../lib';

export default () => {
  return (
    <div>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <br/>
      <Sticky distance={100}>
        <Button type="primary">再动我就要被钉住啦</Button>
      </Sticky>
      <br/>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
      <p>我只是背景墙，不要钉我。。。</p>
    </div>
  )
}
